landang907-ship-it/xiaozhi/Desktop/ESP32 Wroom/test_mic_oled_project/sdkconfig.defaults
# ============================================================================
# sdkconfig.defaults — test_mic_oled (INMP441 Mic + SSD1306 OLED)
# ============================================================================

CONFIG_IDF_TARGET="esp32s3"

# === Flash ===
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# === PSRAM (N16R8: 2MB Octal) ===
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MEMTEST=y

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000

# === Console / UART0 ===
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_NUM=0

# === Logs ===
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# === Watchdog ===
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# === I2S (INMP441 mic) ===
CONFIG_I2S_ISR_IRAM_SAFE=y
